result/20220702-142717_4890da0a6ad983eac0f8081c0c82374dbc64dfc0/benchmark/ab.log
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        nginx/1.18.0
Server Hostname:        localhost
Server Port:            80

Document Path:          /
Document Length:        35241 bytes

Concurrency Level:      1
Time taken for tests:   30.829 seconds
Complete requests:      17
Failed requests:        0
Total transferred:      605421 bytes
HTML transferred:       599097 bytes
Requests per second:    0.55 [#/sec] (mean)
Time per request:       1813.492 [ms] (mean)
Time per request:       1813.492 [ms] (mean, across all concurrent requests)
Transfer rate:          19.18 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:  1788 1813  88.7   1793    2157
Waiting:     1788 1813  88.3   1793    2156
Total:       1788 1813  88.7   1793    2158

Percentage of the requests served within a certain time (ms)
  50%   1792
  66%   1794
  75%   1795
  80%   1795
  90%   1797
  95%   2158
  98%   2158
  99%   2158
 100%   2158 (longest request)